"use client";
import React, { memo } from "react";
import { Container, Typography, Paper, Divider, Box } from "@mui/material";

const sections = [
    {
        title: "من نحن",
        content: [
            "في موقع (مؤسسة النخبة للخدمات الحرفية و نقل العفش)، ندرك أن خصوصية معلوماتك الشخصية هامة لك ولنا.",
            "فيما يلي معلومات حول أنواع المعلومات الشخصية التي نتلقاها ونقوم بجمعها عند زيارات (مؤسسة النخبة للخدمات الحرفية و نقل العفش)، وكيف نقوم بحماية معلوماتك الشخصية.",
        ],
    },
    {
        title: "ملفات السجل",
        content: [
            "كما هو الحال مع معظم مواقع الويب المختلفة، نقوم بجمع واستخدام البيانات الموجودة في ملفات السجل.",
            "تشمل المعلومات الموجودة في ملفات السجل عنوان بروتوكول الإنترنت (IP) الخاص بك، ومزود خدمة الإنترنت (ISP)، والمتصفح الذي استخدمته لزيارة موقعنا، والوقت الذي قمت فيه بالزيارة، والصفحات التي قمت بزيارتها عبر موقعنا.",
        ],
    },
    {
        title: "ملفات تعريف الارتباط",
        content: [
            "نحن نستخدم ملفات تعريف الارتباط لنمنحك أفضل تجربة أستخدام ممكنة على موقع بسيط، لمزيد من المعلومات حول ملفات تعريف الارتباط، تفضل بزيارة: What are cookies.",
            "ملفات تعريف الارتباط الأساسية: تعد ملفات تعريف الارتباط الأساسية ضرورية لك للتنقل والتنقل في جميع أنحاء الموقع، ولا تخزن أي معلومات يمكن استخدامها لأغراض الدعاية، وبدونها لن يعمل موقعنا بشكل صحيح.",
            "ملفات تعريف الارتباط المخصصة: تخزن ملفات تعريف الارتباط هذه المعلومات مثل تفضيلاتك الشخصية وتستخدمها لتخصيص تجربة فريدة لك. قد يشمل ذلك عرض نافذة منبثقة مرة واحدة فقط في زيارتك، أو حفظ تفضيلات اللغة، أو السماح لك بتسجيل الدخول تلقائيًا إلى بعض ميزاتنا.",
        ],
    },
    {
        title: "ملفات تعريف الارتباط في Analytics",
        content: [
            "تلتقط ملفات تعريف الارتباط من Analytics بيانات مجهولة المصدر حتى نتمكن من رؤية الاتجاهات وتحسين تجربة موقعنا على الويب.",
            "هذه تتيح لنا اختبار تصميمات مختلفة وتساعدنا على تحديد الكسر إذا كان جزء من موقعنا لا يعمل.",
        ],
    },
    {
        title: "ملفات تعريف الارتباط للإعلانات",
        content: [
            "قد يستخدم بعض المعلنين من الجهات الخارجية ملفات تعريف الارتباط أو إشارات الويب عند الإعلان على موقعنا.",
            "سيقوم هؤلاء بإرسال معلومات إلى هؤلاء المعلنين (مثل Google من خلال برنامج Google AdSense) بما في ذلك عنوان IP الخاص بك، ومزود خدمة الإنترنت، والمتصفح الذي استخدمته لزيارة موقعنا، وفي بعض الحالات معلومات حول ما إذا كنت قد قمت بتثبيت Flash.",
            "يستخدم موردو الجهات الخارجية، بمن فيهم Google، ملفات تعريف ارتباط لعرض الإعلانات بناءً على زيارات المستخدم السابقة لموقعنا الإلكتروني أو لمواقع أخرى على الويب.",
        ],
    },
    {
        title: "الاتصال",
        content: [
            "إذا كان لديك أي سؤال أو كانت هناك مشكلة في سياسة استخدام البيانات الخاصة بنا، الرجاء المراسلة عبر صفحة 'الاتصال بنا'.",
        ],
    },
];

const PrivacyPolicyPage = memo(() => {
    return (
        <Container sx={{ my: 4 }}>
            <Paper sx={{ p: 4, borderRadius: "8px", boxShadow: 1, bgcolor: "background.paper" }}>
                <Typography variant="h3" align="center" gutterBottom color="primary">
                    سياسة الخصوصية
                </Typography>
                <Divider sx={{ my: 2 }} />

                {sections.map((section, index) => (
                    <Box key={index} sx={{ my: 3 }}>
                        <Typography variant="h5" gutterBottom color="primary">
                            {section.title}
                        </Typography>
                        {section.content.map((paragraph, idx) => (
                            <Typography key={idx} variant="body1" paragraph sx={{ textAlign: "justify" }}>
                                {paragraph}
                            </Typography>
                        ))}
                        <Divider sx={{ my: 2 }} />
                    </Box>
                ))}
            </Paper>
        </Container>
    );
});

export default PrivacyPolicyPage;
